### 📖 Terraform Plan

```hcl
[command]/home/runner/work/_temp/1f6ce62a-9912-4388-84e3-43e5deba32d2/terraform-bin plan -var-file=terraform.tfvars -no-color
2025-06-20T19:52:13.639Z [INFO]  Terraform version: 1.6.6
2025-06-20T19:52:13.639Z [INFO]  Go runtime version: go1.21.5
2025-06-20T19:52:13.639Z [INFO]  CLI args: []string{"/home/runner/work/_temp/1f6ce62a-9912-4388-84e3-43e5deba32d2/terraform-bin", "plan", "-var-file=terraform.tfvars", "-no-color"}
2025-06-20T19:52:13.640Z [INFO]  CLI command args: []string{"plan", "-var-file=terraform.tfvars", "-no-color"}
2025-06-20T19:52:14.152Z [INFO]  backend/local: starting Plan operation
2025-06-20T19:52:14.154Z [INFO]  provider: configuring client automatic mTLS
2025-06-20T19:52:14.282Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: configuring server automatic mTLS: timestamp=2025-06-20T19:52:14.282Z
2025-06-20T19:52:15.270Z [INFO]  provider: configuring client automatic mTLS
2025-06-20T19:52:15.390Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: configuring server automatic mTLS: timestamp=2025-06-20T19:52:15.390Z
2025-06-20T19:52:15.513Z [INFO]  backend/local: plan calling Plan
2025-06-20T19:52:15.516Z [INFO]  provider: configuring client automatic mTLS
2025-06-20T19:52:15.636Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: configuring server automatic mTLS: timestamp=2025-06-20T19:52:15.636Z
2025-06-20T19:52:15.742Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: Retrieved credentials: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=ee9f2177-7213-55ca-e3af-f8ba68183d4a tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.65/logging/tf_logger.go:39 @module=aws.aws-base tf_aws.credentials_source=StaticCredentials tf_mux_provider="*schema.GRPCProviderServer" timestamp=2025-06-20T19:52:15.742Z
2025-06-20T19:52:16.066Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: Retrieved caller identity from STS: @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=ee9f2177-7213-55ca-e3af-f8ba68183d4a @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.65/logging/tf_logger.go:39 tf_rpc=ConfigureProvider timestamp=2025-06-20T19:52:16.066Z
2025-06-20T19:52:16.086Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.aws_s3.aws_s3_bucket.website[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .lifecycle_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .object_lock_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .replication_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .versioning: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .website: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .cors_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .logging: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .server_side_encryption_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .grant: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2025-06-20T19:52:16.089Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.aws_s3.aws_s3_bucket_website_configuration.website, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .routing_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2025-06-20T19:52:16.100Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws_s3.data.aws_iam_policy_document.website_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "website_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowPublicRead"

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.aws_s3.aws_s3_bucket.website[0] will be created
  + resource "aws_s3_bucket" "website" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-bucket-inbest-x1"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "customer"    = "Test"
          + "environment" = "default"
          + "owner"       = "Carlos Escobar"
          + "project"     = "Terraform_testing"
        }
      + tags_all                    = {
          + "customer"    = "Test"
          + "environment" = "default"
          + "owner"       = "Carlos Escobar"
          + "project"     = "Terraform_testing"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.aws_s3.aws_s3_bucket_public_access_block.public_access[0] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.aws_s3.aws_s3_bucket_website_configuration.website will be created
  + resource "aws_s3_bucket_website_configuration" "website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_arn  = (known after apply)
  + bucket_id   = (known after apply)
  + bucket_name = "test-bucket-inbest-x1"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.aws_s3.data.aws_iam_policy_document.website_policy will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "website_policy" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:GetObject",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "AllowPublicRead"%0A%0A          + principals {%0A              + identifiers = [%0A                  + "*",%0A                ]%0A              + type        = "AWS"%0A            }%0A        }%0A    }%0A%0A  # module.aws_s3.aws_s3_bucket.website[0] will be created%0A  + resource "aws_s3_bucket" "website" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "test-bucket-inbest-x1"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = true%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "customer"    = "Test"%0A          + "environment" = "default"%0A          + "owner"       = "Carlos Escobar"%0A          + "project"     = "Terraform_testing"%0A        }%0A      + tags_all                    = {%0A          + "customer"    = "Test"%0A          + "environment" = "default"%0A          + "owner"       = "Carlos Escobar"%0A          + "project"     = "Terraform_testing"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.aws_s3.aws_s3_bucket_public_access_block.public_access[0] will be created%0A  + resource "aws_s3_bucket_public_access_block" "public_access" {%0A      + block_public_acls       = false%0A      + block_public_policy     = false%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = false%0A      + restrict_public_buckets = false%0A    }%0A%0A  # module.aws_s3.aws_s3_bucket_website_configuration.website will be created%0A  + resource "aws_s3_bucket_website_configuration" "website" {%0A      + bucket           = (known after apply)%0A      + id               = (known after apply)%0A      + routing_rules    = (known after apply)%0A      + website_domain   = (known after apply)%0A      + website_endpoint = (known after apply)%0A%0A      + index_document {%0A          + suffix = "index.html"%0A        }%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + bucket_arn  = (known after apply)%0A  + bucket_id   = (known after apply)%0A  + bucket_name = "test-bucket-inbest-x1"%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2025-06-20T19:52:13.639Z [INFO]  Terraform version: 1.6.6%0A2025-06-20T19:52:13.639Z [INFO]  Go runtime version: go1.21.5%0A2025-06-20T19:52:13.639Z [INFO]  CLI args: []string{"/home/runner/work/_temp/1f6ce62a-9912-4388-84e3-43e5deba32d2/terraform-bin", "plan", "-var-file=terraform.tfvars", "-no-color"}%0A2025-06-20T19:52:13.640Z [INFO]  CLI command args: []string{"plan", "-var-file=terraform.tfvars", "-no-color"}%0A2025-06-20T19:52:14.152Z [INFO]  backend/local: starting Plan operation%0A2025-06-20T19:52:14.154Z [INFO]  provider: configuring client automatic mTLS%0A2025-06-20T19:52:14.282Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: configuring server automatic mTLS: timestamp=2025-06-20T19:52:14.282Z%0A2025-06-20T19:52:15.270Z [INFO]  provider: configuring client automatic mTLS%0A2025-06-20T19:52:15.390Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: configuring server automatic mTLS: timestamp=2025-06-20T19:52:15.390Z%0A2025-06-20T19:52:15.513Z [INFO]  backend/local: plan calling Plan%0A2025-06-20T19:52:15.516Z [INFO]  provider: configuring client automatic mTLS%0A2025-06-20T19:52:15.636Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: configuring server automatic mTLS: timestamp=2025-06-20T19:52:15.636Z%0A2025-06-20T19:52:15.742Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: Retrieved credentials: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=ee9f2177-7213-55ca-e3af-f8ba68183d4a tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.65/logging/tf_logger.go:39 @module=aws.aws-base tf_aws.credentials_source=StaticCredentials tf_mux_provider="*schema.GRPCProviderServer" timestamp=2025-06-20T19:52:15.742Z%0A2025-06-20T19:52:16.066Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: Retrieved caller identity from STS: @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=ee9f2177-7213-55ca-e3af-f8ba68183d4a @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.65/logging/tf_logger.go:39 tf_rpc=ConfigureProvider timestamp=2025-06-20T19:52:16.066Z%0A2025-06-20T19:52:16.086Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.aws_s3.aws_s3_bucket.website[0], but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .lifecycle_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .object_lock_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .replication_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .versioning: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .website: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .cors_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .logging: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .server_side_encryption_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .grant: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2025-06-20T19:52:16.089Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.aws_s3.aws_s3_bucket_website_configuration.website, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .routing_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2025-06-20T19:52:16.100Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

::set-output name=stdout::%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.aws_s3.data.aws_iam_policy_document.website_policy will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "website_policy" {%0A      + id            = (known after apply)%0A      + json          = (known after apply)%0A      + minified_json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:GetObject",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A          + sid       = "AllowPublicRead"%0A%0A          + principals {%0A              + identifiers = [%0A                  + "*",%0A                ]%0A              + type        = "AWS"%0A            }%0A        }%0A    }%0A%0A  # module.aws_s3.aws_s3_bucket.website[0] will be created%0A  + resource "aws_s3_bucket" "website" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "test-bucket-inbest-x1"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = true%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "customer"    = "Test"%0A          + "environment" = "default"%0A          + "owner"       = "Carlos Escobar"%0A          + "project"     = "Terraform_testing"%0A        }%0A      + tags_all                    = {%0A          + "customer"    = "Test"%0A          + "environment" = "default"%0A          + "owner"       = "Carlos Escobar"%0A          + "project"     = "Terraform_testing"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.aws_s3.aws_s3_bucket_public_access_block.public_access[0] will be created%0A  + resource "aws_s3_bucket_public_access_block" "public_access" {%0A      + block_public_acls       = false%0A      + block_public_policy     = false%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = false%0A      + restrict_public_buckets = false%0A    }%0A%0A  # module.aws_s3.aws_s3_bucket_website_configuration.website will be created%0A  + resource "aws_s3_bucket_website_configuration" "website" {%0A      + bucket           = (known after apply)%0A      + id               = (known after apply)%0A      + routing_rules    = (known after apply)%0A      + website_domain   = (known after apply)%0A      + website_endpoint = (known after apply)%0A%0A      + index_document {%0A          + suffix = "index.html"%0A        }%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + bucket_arn  = (known after apply)%0A  + bucket_id   = (known after apply)%0A  + bucket_name = "test-bucket-inbest-x1"%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A

::set-output name=stderr::2025-06-20T19:52:13.639Z [INFO]  Terraform version: 1.6.6%0A2025-06-20T19:52:13.639Z [INFO]  Go runtime version: go1.21.5%0A2025-06-20T19:52:13.639Z [INFO]  CLI args: []string{"/home/runner/work/_temp/1f6ce62a-9912-4388-84e3-43e5deba32d2/terraform-bin", "plan", "-var-file=terraform.tfvars", "-no-color"}%0A2025-06-20T19:52:13.640Z [INFO]  CLI command args: []string{"plan", "-var-file=terraform.tfvars", "-no-color"}%0A2025-06-20T19:52:14.152Z [INFO]  backend/local: starting Plan operation%0A2025-06-20T19:52:14.154Z [INFO]  provider: configuring client automatic mTLS%0A2025-06-20T19:52:14.282Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: configuring server automatic mTLS: timestamp=2025-06-20T19:52:14.282Z%0A2025-06-20T19:52:15.270Z [INFO]  provider: configuring client automatic mTLS%0A2025-06-20T19:52:15.390Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: configuring server automatic mTLS: timestamp=2025-06-20T19:52:15.390Z%0A2025-06-20T19:52:15.513Z [INFO]  backend/local: plan calling Plan%0A2025-06-20T19:52:15.516Z [INFO]  provider: configuring client automatic mTLS%0A2025-06-20T19:52:15.636Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: configuring server automatic mTLS: timestamp=2025-06-20T19:52:15.636Z%0A2025-06-20T19:52:15.742Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: Retrieved credentials: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=ee9f2177-7213-55ca-e3af-f8ba68183d4a tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.65/logging/tf_logger.go:39 @module=aws.aws-base tf_aws.credentials_source=StaticCredentials tf_mux_provider="*schema.GRPCProviderServer" timestamp=2025-06-20T19:52:15.742Z%0A2025-06-20T19:52:16.066Z [INFO]  provider.terraform-provider-aws_v5.100.0_x5: Retrieved caller identity from STS: @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=ee9f2177-7213-55ca-e3af-f8ba68183d4a @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.65/logging/tf_logger.go:39 tf_rpc=ConfigureProvider timestamp=2025-06-20T19:52:16.066Z%0A2025-06-20T19:52:16.086Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.aws_s3.aws_s3_bucket.website[0], but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .lifecycle_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .object_lock_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .replication_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .versioning: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .website: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .cors_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .logging: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .server_side_encryption_configuration: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .grant: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2025-06-20T19:52:16.089Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for module.aws_s3.aws_s3_bucket_website_configuration.website, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .routing_rule: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2025-06-20T19:52:16.100Z [INFO]  backend/local: plan operation completed%0A

::set-output name=exitcode::0
```